src/cf/Enums/ПричиныДобавленияВМоиДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВМоиДокументы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавленВручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначенаЗадачаМне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаЗадачаОтМеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьАвторомДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьАвторомУтвержденияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьОтветственнымЗаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьПодписантомДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВМоиДокументы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет все причины.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы
// 
Функция ВсеПричины() Экспорт
	
	ВсеПричины = Новый Массив;
	ВсеПричины.Добавить(ДобавленВручную);
	ВсеПричины.Добавить(НазначенаЗадачаМне);
	ВсеПричины.Добавить(ОтправленаЗадачаОтМеня);
	ВсеПричины.Добавить(ЯвляюсьАвторомДокумента);
	ВсеПричины.Добавить(ЯвляюсьОтветственнымЗаДокумент);
	ВсеПричины.Добавить(ЯвляюсьПодписантомДокумента);
	ВсеПричины.Добавить(ЯвляюсьАвторомУтвержденияДокумента);
	
	Возврат ВсеПричины;
	
КонецФункции

#КонецОбласти

#КонецЕсли
